class AmharicLegalContent {
  final String title;
  final String content;

  AmharicLegalContent({required this.title, required this.content});

  // Terms of Service content
  static AmharicLegalContent termsOfServiceContent() {
    return AmharicLegalContent(
      title: 'የአገልግሎት ውል',
      content: '''
      የአደጋ ጊዜ አምቡላንስ ቦታ ማስያዝ የሞባይል መተግበሪያን ("መተግበሪያውን") በመጠቀም እነዚህን ውሎች እና ሁኔታዎች ("ውሎቹን") ለማክበር እና ለመገዛት ተስማምተሃል። እባክዎ መተግበሪያውን ከመጠቀምዎ በፊት እነዚህን ውሎች በጥንቃቄ ያንብቡ።
      
      1. የአደጋ ጊዜ አገልግሎቶች፡ አፕ ለተጠቃሚዎች የአደጋ ጊዜ የአምቡላንስ አገልግሎት እንዲጠይቁ መድረክን ይሰጣል።
      
      2. የተጠቃሚ ኃላፊነቶች፡ ተጠቃሚዎች የአምቡላንስ አገልግሎት ሲጠይቁ ትክክለኛ መረጃ መስጠት አለባቸው። የመተግበሪያውን አላግባብ መጠቀም ወይም አላግባብ መጠቀም የመለያ መታገድን ሊያስከትል ይችላል።
      
      3. የውሸት ጥያቄዎች፡- የአምቡላንስ አገልግሎት የውሸት ጥያቄ ማቅረብ በጥብቅ የተከለከለ እና ህጋዊ እርምጃን ሊያስከትል ይችላል። የሐሰት ጥያቄዎችን ሲያቀርቡ የተገኙ ተጠቃሚዎች ለባለሥልጣናት ሪፖርት ይደረጋሉ፣ እና ቅጣት እና የወንጀል ክሶችን ጨምሮ ህጋዊ እርምጃዎች በእነሱ ላይ ሊወሰዱ ይችላሉ።
      
      4. የተጠያቂነት ገደብ፡ መተግበሪያው እና አጋሮቹ ከመተግበሪያው አጠቃቀም ጋር በተያያዙ ወይም በማናቸውም መንገድ ለሚደርሱ ማናቸውም ቀጥተኛ፣ ቀጥተኛ ያልሆኑ፣ ድንገተኛ፣ ልዩ እና ተከታይ ጉዳቶች ተጠያቂ አይሆኑም።
      
      5. ግላዊነት፡ የእርስዎን ግላዊነት ለመጠበቅ ቁርጠኞች ነን። የግላዊነት መመሪያችን እንዴት መረጃ እንደምንሰበስብ፣ እንደምንጠቀም እና እንደምንገልጥ ያብራራል። መተግበሪያውን በመጠቀም፣ በግላዊነት መመሪያው ተስማምተዋል።
      
      6. ማሻሻያዎች፡ እነዚህን ውሎች በማንኛውም ጊዜ የማሻሻል ወይም የማሻሻል መብታችን የተጠበቀ ነው። ከእንደዚህ አይነት ለውጦች በኋላ የመተግበሪያውን ቀጣይ አጠቃቀም አዲሱን ውሎች መቀበልዎን ያካትታል።
      
      እባክዎን በድረ-ገፃችን ላይ ያለውን ሙሉ የአገልግሎት ውሎችን ይከልሱ።
      ''',
    );
  }

  // Privacy Policy content
  static AmharicLegalContent privacyPolicyContent() {
    return AmharicLegalContent(
      title: 'የ ግል ፖሊሲ',
      content: '''
      የግላዊነት መመሪያችን የድንገተኛ አምቡላንስ ቦታ ማስያዝ የሞባይል መተግበሪያን ("መተግበሪያውን") ሲጠቀሙ እንዴት እንደምንሰበስብ፣ እንደምንጠቀም እና እንደምንገልጥ ያብራራል። መተግበሪያውን በመጠቀም፣ በዚህ መመሪያ መሰረት መረጃን ለመሰብሰብ እና ለመጠቀም ተስማምተሃል።

      የመረጃ አሰባሰብ እና አጠቃቀም፡ አፑን ሲጠቀሙ የአምቡላንስ አገልግሎቶችን ሲጠይቁ እንደ የእርስዎ ስም፣ የመገኛ አድራሻ እና አካባቢ ያሉ የግል መረጃዎችን ልንሰበስብ እንችላለን።

      መረጃ መጋራት፡ የአምቡላንስ መላክን ለማመቻቸት የእርስዎን መረጃ ከድንገተኛ አገልግሎት አቅራቢዎች ጋር ልናካፍል እንችላለን።

      የውሂብ ደህንነት፡ የእርስዎን ግላዊ መረጃ ለመጠበቅ የደህንነት እርምጃዎችን እንተገብራለን፣ ነገር ግን ምንም አይነት በበይነ መረብ ወይም በኤሌክትሮኒክስ ማከማቻ ላይ 100% ደህንነቱ የተጠበቀ የማስተላለፍ ዘዴ የለም።

      የልጆች ግላዊነት፡ አፕ ከ13 አመት በታች ለሆኑ ግለሰቦች ጥቅም ላይ እንዲውል የታሰበ አይደለም። እያወቅን ከልጆች የግል መረጃ አንሰበስብም።

      በዚህ የግላዊነት ፖሊሲ ላይ የተደረጉ ለውጦች፡ የግላዊነት መመሪያችንን ከጊዜ ወደ ጊዜ ማዘመን እንችላለን። ለማንኛውም ለውጦች ይህን ገጽ በየጊዜው እንዲገመግሙት ይመከራሉ።

      ያግኙን፡ ስለ ግላዊነት ፖሊሲያችን ማንኛቸውም ጥያቄዎች ካሉዎት እባክዎን ያግኙን።
      ''',
    );
  }
}
